<script>
  import FlippingCard from "./FlippingCard.svelte";

  const dataArr = [
    { p: "Быстро снижать уровень стресса", img: "" },
    { p: "Необходимо осознать, что у вас стресс. Как вы нв него реагируете?", img: "" },
    { p: "Необходимо найти свою технику борьбы со стрессом", img: "" },
    { p: "Устанавливать контакт с окружающими, используя невербальную коммуникацию", img: "" },
    {
      p: "Нужно фокусироваться на своем собеседнике, установить с ним зрительный контакт, обращать внимание на выражений лица, тон голоса, положения тела собеседника",
      img: "",
    },
    {
      p: "Использовать юмор и игру, чтобы справляться с вызовами и преодолевать препятствия",
      img: "",
    },
  ];
</script>

<section>
  <h2>Развитие эмоционального интеллекта проходит через развитие нескольких навыков</h2>

  <FlippingCard {dataArr} />
</section>
